{
    "codes" : 
    {
        "EXTR": "extrovert",
        "INTR": "introvert",
        "INTU": "intuition",
        "SENS": "sensing",
        "FEEL": "feeling",
        "THIN": "thinking",
        "JUDG": "judging",
        "PERC": "perceiving"
    },
    "questionTypes" : 
    {
        "1": "EXTR",
        "2": "INTU",
        "3": "FEEL",
        "4": "JUDG",
        "5": "INTU",
        "6": "INTR",
        "7": "JUDG",
        "8": "FEEL",
        "9": "JUDG",
        "10": "SENS",
        "11": "EXTR",
        "12": "SENS",
        "13": "THIN",
        "14": "PERC",
        "15": "EXTR",
        "16": "INTU",
        "17": "INTR",
        "18": "SENS",
        "19": "THIN",
        "20": "PERC"
    },
    "questions" :
    {
        "1": "It's easy for you to make friends.",
        "2": "You enjoy exploring the unknown.",
        "3": "Seeing other people cry makes you want to cry as well.",
        "4": "You always have multiple plans prepared in the event that one fails.",
        "5": "You trust your instincts and gut feelings when making decisions.",
        "6": "You wait for others to approach you first at public events.",
        "7": "You find pleasure in setting reachable goals for yourself.",
        "8": "You value helping others achieve their goals.",
        "9": "You like to use organizing tools to manage your schedule.",
        "10": "You enjoy learning through hands-on experiences and experimentation.",
        "11": "You enjoy approaching others first and striking up conversation.",
        "12": "You prefer not to have invested conversations about abstract ideas.",
        "13": "You view decision-making based on emotion as inefficient.",
        "14": "You prefer to go through your days without a schedule.",
        "15": "You enjoy participating in team-based activities.",
        "16": "Your dreams tend to be vivid and creative.",
        "17": "In a group, you prefer to listen than participate in the discussion.",
        "18": "You often notice small changes in your environment that others might overlook.",
        "19": "You believe it's more important to rely on rationality than emotions.",
        "20": "I'm open to new experiences and opportunities, even if they disrupt my existing plans."
    },
    "descriptions":
    {
        "ISTJ":
        {
            "buddyType": "Terra",    
            "overview": "ISTJs are known for their straightforwardness and commitment to their words. Their responsible and dependable nature is closely tied to their respect for tradition and structure, often leading them to gravitate towards environments with clear hierarchies and expectations, such as workplaces and educational settings. Despite not seeking attention, ISTJs play a crucial role in maintaining societal stability. Within their families and communities, they earn respect for their reliability, practicality, and ability to remain grounded even in stressful situations.",
            "strengths": "Honest and Direct - Integrity is paramount for ISTJs. They prefer dealing with situations honestly rather than engaging in emotional manipulation or deception. \nDisciplined - ISTJs exhibit integrity through their actions, meeting their obligations, and adhering to rules and structures with patience and determination. \nResponsible - They prioritize fulfilling their commitments and duties, demonstrating loyalty and reliability by delivering results on time.",
            "weaknesses": "Stubborn - ISTJs tend to resist new ideas that contradict established facts, making it challenging for them to admit when they are wrong. \nInsensitive - While they consider emotions to some extent, they prioritize honesty over sparing others' feelings, sometimes inadvertently causing hurt. \nJudgmental - Due to their reliance on empirical evidence, they may struggle to respect those who disregard proven information, viewing them as irrational or misguided.",
            "friendships": "In friendships, ISTJs are not spontaneous or overly expressive, but they are loyal, trustworthy, and dependable. They stand by their friends through thick and thin, demonstrating a level of commitment that may seem surprising to other personality types."
        },
        "ISFJ":
        {
            "buddyType": "Terra",
            "overview": "ISFJs have a modest and unassuming manner. They are diligent and committed, feeling a strong sense of duty towards those in their circle. ISFJs can be relied upon to meet deadlines, remember important dates, uphold traditions, and provide unwavering support to their loved ones, all without seeking recognition for their efforts, preferring to work behind the scenes. This personality type is characterized by a blend of capabilities and adaptability. Despite their sensitive and caring nature, ISFJs possess strong analytical skills and attention to detail. Additionally, despite their reserved demeanor, they excel in interpersonal relationships and possess well-developed social skills. Their diverse strengths shine through in their everyday lives, even in mundane tasks.",
            "strengths": "Supportive: ISFJs genuinely enjoy assisting others and willingly share their knowledge and expertise. They prioritize collaboration over competition, striving for mutually beneficial outcomes. \nReliable: They approach tasks methodically, ensuring thoroughness and excellence beyond what is expected. Over time, they find it easier to maintain discipline and reliability. \nObservant: ISFJs possess a knack for noticing subtle details about people, providing them with unique insights into others' lives and emotions.",
            "weaknesses": "Excessive Humility: ISFJs may downplay their contributions and avoid seeking recognition for their efforts, prioritizing others' feelings over their own. \nSensitivity to Criticism: Despite attempts to conceal it, they are deeply affected by others' opinions and may feel personally attacked by criticism or disagreement. \nRepression of Feelings: Preferring to keep their emotions private, ISFJs may internalize negative feelings, leading to misunderstandings in their relationships and occasional outbursts of frustration.",
            "friendships": "Despite their warmth and generosity, ISFJs are selective about forming friendships, as they value deep connections over superficial interactions. Their reserved nature means that they take time to open up to new acquaintances, preferring gradual and consistent interaction to build trust and rapport. This explains why ISFJ friendships often develop through familiar environments like school or work, allowing them to gradually reveal more of themselves over time."
        },
        "INFJ":
        {
            "buddyType": "Aqua",
            "overview": "INFJs are characterized by their idealism and principles. They are driven to make a meaningful impact in the world rather than simply drifting through life. They find fulfillment in helping others and striving to be a positive force for change, valuing personal growth over material success or societal recognition. Despite their lofty aspirations, INFJs are not idle dreamers; they are deeply committed to integrity and ethical behavior. Guided by their strong values, they pursue what they believe to be right with unwavering determination, refusing to compromise their principles for personal gain. Their conscientious nature ensures that they remain steadfast in their convictions, prioritizing their own inner compass over external influences.",
            "strengths": "Insightful: INFJs possess a keen awareness that goes beyond surface appearances, allowing them to discern deeper truths about people and situations. This insightfulness enables them to understand others' motivations and emotions with remarkable accuracy. \nPrincipled: Upholding strong ethical standards, INFJs value honesty and integrity above all else. They are averse to deceit and strive to maintain authenticity in their interactions, making them unlikely to exploit others for personal gain. \nPassionate: Driven by a sense of purpose, INFJs are not content with mediocrity; they aspire to achieve their dreams and make a meaningful impact on the world. Their enthusiasm and vision inspire others to pursue their own passions and ideals.",
            "weaknesses": "Sensitive to Criticism: INFJs can be sensitive to criticism, particularly when it challenges their deeply held beliefs. In such situations, they may react defensively or become dismissive, struggling to accept feedback that contradicts their values. \nReluctant to Open Up: While valuing authenticity, INFJs can also be reserved, finding it challenging to open up about their own struggles. Their reluctance to seek help or share their vulnerabilities may hinder their personal growth and strain their relationships. \nPerfectionistic: INFJs hold themselves to high standards and may struggle with accepting imperfections in themselves and others. Their idealistic nature can lead to dissatisfaction with their circumstances, as they constantly seek to improve and refine their lives.",
            "friendships": "In friendships, INFJs prioritize depth and authenticity over superficial connections. They seek meaningful relationships where they can share their innermost thoughts and feelings without fear of judgment. Although they may appear reserved to outsiders, INFJs light up when in the company of close friends, reveling in the opportunity to express themselves freely and be fully understood and accepted."
        },
        "INTJ":
        {
            "buddyType": "Aqua",
            "overview": "INTJs are characterized by their insatiable curiosity and thirst for knowledge. They prioritize creative problem-solving, logical reasoning, and personal growth, constantly striving to master diverse subjects that capture their interest. Driven by their sharp intellect and disdain for insincerity, INTJs take pride in their independent thinking and ability to discern truth from falsehood. Their active minds may struggle to find peers who can match their analytical depth, but when they do, they form profound and intellectually stimulating relationships that they cherish deeply.",
            "strengths": "Rational: INTJs excel in reframing challenges as opportunities for intellectual growth, using their logical thinking skills to devise innovative solutions. \nInformed: Devoted to evidence-based reasoning, INTJs form opinions grounded in research and analysis, enabling them to confidently defend their ideas. \nIndependent: Preferring originality over conformity, INTJs are self-directed and motivated to pursue their goals without being swayed by external influences.",
            "weaknesses": "Arrogant: Despite their knowledge, INTJs may dismiss valuable input from others, particularly those they perceive as intellectually inferior, and can come across as overly critical. \nDismissive of Emotions: INTJs prioritize rationality over emotional considerations and may grow impatient with those who prioritize feelings over facts, which can lead to misunderstandings. \nOverly Critical: Their high standards and self-control may lead INTJs to unfairly criticize others based on arbitrary criteria, potentially straining relationships.",
            "friendships": "While INTJs may not prioritize social approval or superficial connections, they value meaningful friendships with individuals who share their intellectual curiosity and can engage in stimulating conversations. Though they may appear reserved initially, INTJs seek genuine connections and derive great satisfaction from engaging with those who truly understand them."
        },
        "ISTP":
        {
            "buddyType": "Aqua",
            "overview": "ISTPs have a natural inclination towards hands-on exploration, eagerly delving into the world around them with curiosity, skepticism, and meticulousness. They thrive on creating and tinkering, finding joy in both practical and frivolous projects, continuously learning from their environment. They prefer direct problem-solving approaches, relying on their firsthand experiences and trial-and-error methods to execute their ideas at their own pace and without unnecessary interruptions. They are not inclined towards extensive socializing, finding it taxing, and often opting for smaller, meaningful interactions over superficial networking.",
            "strengths": "Diligent and Observant: ISTPs are typically engrossed in various projects, readily engaging with their surroundings to devise practical solutions. \nHandy and Resourceful: They possess a knack for practical tasks, mechanics, crafts, and skills, effortlessly translating their innovative ideas into action. \nSpontaneous: ISTPs exhibit flexibility and adaptability, adept at thinking on their feet and releasing their energy when necessary.",
            "weaknesses": "Unapologetic: While they can go with the flow, ISTPs may disregard others' preferences and become blunt in expressing their irritation if pushed in a different direction. \nInsensitive: Despite attempts at empathy, their logical nature may result in unintentionally insensitive communication or a preference for silence over emotional exchanges. \nPrivate and Reserved: ISTPs are notoriously guarded about their personal lives, often preferring solitude to small talk and keeping their inner thoughts to themselves.",
            "friendships": "In friendships, ISTPs prioritize autonomy and solitude, being selective about their social engagements. They value personal autonomy highly and are discerning about who they allow into their inner circle, akin to a well-kept secret that only a chosen few have the privilege of accessing."
        },
        "ISFP":
        {
            "buddyType": "Aqua",
            "overview": "ISFPs possess an innate artistic flair that extends beyond conventional art forms, permeating every aspect of their lives as a canvas for self-expression. Their exploratory nature and ability to derive joy from the simple pleasures of life make them captivating individuals. Guided by their sense of fairness and open-mindedness, ISFPs navigate life with an infectious positivity, encouraging those around them to pursue their passions while pursuing their own interests with unwavering enthusiasm. Despite their humility, they often fail to recognize the remarkable impact they have on others.",
            "strengths": "Charming: ISFPs exude warmth and relaxation, fostering a \"live and let live\" atmosphere that endears them to others. \nSensitive to Others: They possess a keen emotional intelligence, effortlessly connecting with others and fostering harmony and goodwill. \nKind and Encouraging: Their innate kindness and fairness create a supportive environment where others feel safe to express themselves, and they are always ready to cheer others on in their pursuits.",
            "weaknesses": "Difficulty with Structure: ISFPs prioritize freedom of expression, feeling stifled by rigid rules and traditions. \nUnpredictable: They shy away from long-term commitments and plans, which can strain relationships and lead to financial instability. \nEasily Stressed: Living in the present and driven by emotion, ISFPs can become overwhelmed in stressful situations, losing their characteristic charm and creativity.",
            "friendships": "In friendships, ISFPs embody curiosity, open-mindedness, and an appreciation for individuality. They offer unwavering support and empathy, intuitively picking up on emotional cues and providing comfort during difficult times. Their laid-back, spontaneous approach to life translates into casual, enjoyable activities with friends, emphasizing the importance of living in the moment."
        },
        "INFP":
        {
            "buddyType": "Aero",
            "overview": "INFPs possess vibrant inner worlds brimming with creativity and sensitivity, despite their outward appearance of quietness. They immerse themselves in imaginative daydreams, deeply affected by music, art, nature, and the people around them. INFPs are sentimental and nostalgic, often cherishing keepsakes that evoke joy and memories. Idealistic and empathetic, INFPs yearn for meaningful connections and are driven by a desire to help others. However, they may feel isolated in a society that doesn't always value their unique qualities. Yet, it is precisely their sensitivity and creativity that give them the potential to forge deep connections and foster positive change.",
            "strengths": "Empathetic: INFPs possess a deep understanding of others' emotions and are compassionate and thoughtful in their interactions. \nGenerous: They are inclined to share their blessings, acknowledge others' contributions, and advocate for inclusivity and equality. \nOpen-Minded: INFPs are tolerant and nonjudgmental, showing empathy even towards those who may have erred, often becoming trusted confidants.",
            "weaknesses": "Unrealistic: INFPs may struggle with accepting imperfections in reality, often harboring idealistic visions that lead to disappointment. \nSelf-Isolating: While craving connection, they may hesitate to engage in new social environments, leading to feelings of loneliness. \nEmotionally Vulnerable: INFPs are highly attuned to emotions but may absorb negativity from others without establishing boundaries, affecting their own well-being.",
            "friendships": "In their social lives, INFPs navigate a complex balance between their desire for solitude and their need for acceptance. They value authenticity and genuine connections but may struggle with feelings of invisibility or insecurity. True friendships provide them with solace and purpose, as they believe in supporting and uplifting each other through life's challenges. INFPs prioritize quality over quantity in their friendships, preferring intimate connections where they can freely express their innermost thoughts and feelings without fear of judgment. While acquaintances may come and go, their inner circle likely consists of lifelong friends who share their deepest hopes and fears."
        },
        "INTP":
        {
            "buddyType": "Aero",
            "overview": "INTPs take pride in their distinct viewpoint and sharp intellect. They are naturally drawn to pondering the mysteries of the universe, a trait shared by many influential philosophers and scientists throughout history. INTPs tend to value solitude, finding it conducive to deep contemplation, and they are unafraid to express their innovative ideas, often standing out from the crowd.",
            "strengths": "Open-Minded: INTPs are driven by curiosity and a thirst for knowledge, readily embracing new ideas even in contentious areas like politics and religion. \nCurious: They possess an insatiable appetite for learning, delving into diverse subjects with enthusiasm and immersing themselves fully in their interests. \nHonest: INTPs prioritize truth over ideology, valuing honesty and integrity in their interactions and expecting the same from others.",
            "weaknesses": "Disconnected: Their tendency to become absorbed in their thoughts can lead INTPs to feel disconnected from others, especially in social settings where conversations move quickly. \nInsensitive: While rationality guides their worldview, they may overlook the importance of emotions and traditional values, inadvertently appearing insensitive. \nDissatisfied: INTPs constantly seek improvement, which can result in perpetual dissatisfaction and a tendency to overanalyze rather than address their needs and responsibilities.",
            "friendships": "In friendships, INTPs seek intellectual depth alongside companionship and support. They are selective in their choice of friends, valuing those who stimulate their intellect. Though they may not actively seek out social interaction, when they do engage, they can be lively and imaginative companions, surprising others with their insightful and unexpected contributions to the conversation."
        },
        "ESTP":
        {
            "buddyType": "Pyro",
            "overview": "ESTPs exude a lively and spontaneous energy that is infectious. They thrive on competition, viewing it as essential for success, and are action-oriented, rarely dwelling on the past and preferring to keep their focus on the present moment. ESTPs are not interested in abstract theories or prolonged discussions about global issues; instead, they prefer lively conversations and direct action. They are quick to leap into action, learning from their mistakes as they go rather than meticulously planning every detail.",
            "strengths": "Perceptive: ESTPs have a keen eye for noticing changes and using them to build connections with others. \nDirect: They value clear communication and prefer to speak plainly, without any hidden agendas. \nSociable: Natural leaders, ESTPs excel in social settings, effortlessly networking and engaging with others.",
            "weaknesses": "Insensitive: They prioritize facts over emotions, often struggling in emotionally charged situations and avoiding heavy topics or dwelling on the past. \nImpatient: ESTPs dislike slowing down or focusing on one detail for too long, preferring to maintain a fast-paced lifestyle. \nImpulsive: Their impatience can lead to risky behavior and a disregard for long-term consequences.",
            "friendships": "ESTPs are the life of the party, effortlessly captivating others with their vibrant personality and earthy humor. They possess an adventurous spirit and a knack for spontaneity, always keeping those around them entertained with their imaginative ideas and fun activities. Despite their outgoing nature, they are easygoing and charming, making them highly popular among their peers."
        },
        "ESFP":
        {
            "buddyType": "Pyro",
            "overview": "ESFPs are often the life of the party, known for their spontaneous bursts of song and dance. They thrive on excitement and are incredibly generous in their efforts to uplift others, doing so with a unique and irresistible flair. ESFPs find joy in the simple pleasures of life, particularly in the company of good friends. They prioritize socializing over solitude and have a natural talent for captivating attention with their earthy humor and lively presence, turning any gathering into a celebration.",
            "strengths": "Bold: ESFPs embrace new experiences and are willing to step out of their comfort zones without hesitation. \nOriginal: They eschew tradition and expectations, preferring to experiment with new styles and stand out in various aspects of life. \nPositive and Enthusiastic: ESFPs radiate optimism and enthusiasm, drawing others to them with their engaging charisma and open-minded approach to life's experiences.",
            "weaknesses": "Sensitive: ESFPs are emotionally sensitive and can react strongly to criticism, feeling cornered and responding poorly. \nConflict-Averse: They tend to avoid conflict and may resort to saying or doing what is necessary to escape uncomfortable situations. \nEasily Bored: Without constant excitement, ESFPs may engage in risky behavior or indulge in the pleasures of the moment rather than focusing on long-term plans.",
            "friendships": "Entertainers are known for their outgoing and social nature, sharing their experiences and optimism with a wide circle of friends. They excel at making new connections, using their charm and openness to foster relationships. However, they may struggle to maintain existing friendships as they become easily distracted by new adventures, sometimes overlooking the value of long-term connections."
        },
        "ENFP":
        {
            "buddyType": "Aero",
            "overview": "ENFPs embody the essence of free-spiritedness - they are outgoing, open-hearted, and open-minded. Their vibrant and positive outlook on life makes them stand out in any social setting, but their focus extends beyond mere enjoyment; ENFPs crave deep emotional connections with others, driven by their profound inner depths. ENFPs possess a captivating blend of sociability, imagination, and introspection. They leverage their natural curiosity and expansive creativity to explore themselves and the complexities of human relationships, showing a genuine commitment to understanding both themselves and the world around them.",
            "strengths": "Excellent Communicators: ENFPs excel in both expressing themselves and listening to others, fostering positive and enjoyable conversations with a diverse range of individuals. \nEasygoing: While they value deep conversations, ENFPs also embrace spontaneity and joy in the present moment, eagerly sharing their happiness with those around them. \nGood-Natured and Positive: Warmhearted and approachable, ENFPs radiate altruism and maintain friendly relationships with a wide network of acquaintances and friends.",
            "weaknesses": "People-Pleasing: ENFPs often strive to avoid conflict and seek approval from others, sometimes compromising their own values or allowing mistreatment from others in the process. \nUnfocused: While ENFPs thrive in new projects and collaborations, their ever-evolving interests can make it challenging for them to maintain long-term discipline and focus.\nDisorganized: Their penchant for exploring new ideas and experiences may lead ENFPs to neglect routine tasks, causing disorganization and stress in their lives.",
            "friendships": "With their natural charisma, ENFPs effortlessly attract friends from various walks of life, taking pride in their ability to build diverse social circles through their charm and communication skills. As friends, ENFPs offer uplifting support and authenticity, readily engaging in both lighthearted banter and heartfelt discussions. However, they may occasionally struggle with feelings of insecurity, fearing that they invest more in their friendships than they receive in return, which can leave them feeling lonely despite their sociable nature."
        },
        "ENTP":
        {
            "buddyType": "Aero",
            "overview": "ENTPs are sharp-minded and daring individuals. They embrace intellectual challenges and thrive on disagreement. They relish verbal sparring and engaging in spirited debates, finding excitement in exploring controversial topics. However, it would be a misconception to view ENTPs as hostile or antagonistic. Instead, they possess a wealth of knowledge, curiosity, and a playful sense of humor, making them entertaining conversationalists. Their idea of fun often involves engaging in lively debates, reflecting their offbeat and contrarian nature.",
            "strengths": "Quick Thinkers: ENTPs exhibit remarkable mental agility, effortlessly shifting between ideas and drawing upon their extensive knowledge to support their arguments. They excel in discussions, seamlessly navigating diverse topics with ease. \nCharismatic: With their eloquence and wit, ENTPs captivate others with their confident and engaging communication style. Their ability to connect disparate ideas in novel ways makes their conversations both charming and informative. \nEnergetic: ENTPs display impressive enthusiasm and energy when presented with intriguing problems, demonstrating a willingness to invest long hours to find innovative solutions.",
            "weaknesses": "Argumentative: ENTPs relish the intellectual stimulation of debating ideas, but their penchant for vigorous disagreement can create tension with those who prefer consensus. They may inadvertently undermine others' beliefs with their assertiveness. \nInsensitive: Driven by rationality, ENTPs may overlook others' emotions during debates, pushing discussions beyond acceptable boundaries. They tend to prioritize logical arguments over emotional considerations, which can strain interpersonal relationships. \nIntolerant: ENTPs are inclined to dismiss ideas and individuals who fail to meet their rigorous standards of rationality. They may disregard suggestions that cannot withstand their scrutiny, leading to a perception of intolerance.",
            "friendships": "For ENTPs, earning recognition in a debate requires rigorous scrutiny and logical defense. They welcome challenges to their ideas, eagerly seeking opportunities to refine their arguments through counterpoints and rebuttals. Friendship compatibility for ENTPs often hinges on intellectual engagement. They appreciate individuals who can match their rapid thought processes and introduce fresh perspectives. ENTPs readily engage in discussions, spending hours debating ideas with potential friends, seeking those who can keep pace with their agile minds and offer stimulating insights."
        },
        "ESTJ":
        {
            "buddyType": "Terra",
            "overview": "ESTJs embody tradition and order, using their sense of what is morally right and socially acceptable to unite families and communities. Esteeming honesty and commitment, ESTJs are esteemed for their mentorship and their knack for devising and executing plans diligently and effectively. They willingly take charge in challenging situations and persevere through adversity.Esteeming concrete, verifiable facts, ESTJs navigate a world governed by clear principles and steadfast convictions. Their unwavering confidence in their knowledge enables them to uphold their values and advocate for a clear vision of what is acceptable. Far from mere rhetoric, ESTJs eagerly tackle demanding tasks, refining strategies and managing details with ease, making complex endeavors seem straightforward.",
            "strengths": "Determined: Possessing a strong will, ESTJs steadfastly defend their beliefs and principles against opposition, requiring clear and compelling evidence to reconsider their stance. \nDirect and Truthful: ESTJs prioritize factual information over abstract concepts, valuing straightforward communication and honesty in their interactions, even if it's not always well-received. \nLoyal, Patient, and Dependable: Committed to truthfulness and reliability, ESTJs uphold stability and security as fundamental values, fulfilling their promises and earning trust as responsible members of their social circles.",
            "weaknesses": "Inflexible and Obstinate: Preferring proven methods, ESTJs may overlook potentially superior alternatives, reluctant to consider opinions that challenge their established practices. \nAversion to Change: Strongly adhering to tradition, ESTJs feel uneasy and stressed when compelled to adopt untested solutions, fearing failure and questioning the adequacy of their methods. \nJudgmental: With firm convictions about right and wrong, ESTJs tend to impose their standards on others, dismissing alternative perspectives and striving to impose order without recognizing diverse approaches.",
            "friendships": "In friendships, ESTJs value loyalty and shared values, often bonding over shared activities and routines rather than intellectual or spiritual alignment. Despite occasional assertiveness, ESTJs are outgoing and enthusiastic companions, eager to engage in outdoor activities and sports with their friends. Their zeal for inclusion may come across as overbearing at times, but it stems from a genuine desire for everyone to enjoy themselves."
        },
        "ENFJ":
        {
            "buddyType": "Pyro",
            "overview": "ENFJs feel a deep-seated calling to contribute to a greater cause in life. Thoughtful and idealistic, ENFJs are driven to make a positive impact on others and the world at large, even when faced with considerable challenges. Natural leaders, ENFJs are commonly found in roles such as politicians, coaches, and teachers, leveraging their passion and charisma to inspire others across various aspects of their lives, including personal relationships. Guiding friends and loved ones to reach their full potential brings ENFJs profound joy and fulfillment.",
            "strengths": "Open-minded: Despite having strong opinions, ENFJs value allowing others to express themselves fully, recognizing the importance of diverse perspectives. \nReliable: ENFJs prioritize honoring their commitments and responsibilities, striving to fulfill promises even in challenging circumstances. \nPassionate: ENFJs pursue their interests with enthusiasm, finding pleasure in a wide range of hobbies and activities.",
            "weaknesses": "Unrealistic: ENFJs may feel pressure to address every injustice, yet it's not feasible to solve all the world's problems single-handedly, risking burnout by overextending themselves. \nOverly idealistic: ENFJs hold clear principles of right and wrong and may expect everyone to share or adhere to these values, leading to disappointment when others fall short. \nCondescending: While ENFJs enjoy educating others about their beliefs, their attempts to enlighten may be perceived as patronizing, hindering effective communication.",
            "friendships": "For ENFJs, meaningful connections with others are essential for a fulfilling life, and they invest sincere effort in maintaining close friendships. They find great pleasure in discovering the unique perspectives and experiences of others, even when they differ from their own, as encountering diverse viewpoints enriches their lives."
        },
        "ENTJ":
        {
            "buddyType": "Pyro",
            "overview": "ENTJs possess innate leadership qualities. Charismatic and confident, ENTJs exude authority, rallying others behind shared objectives with their drive, determination, and sharp intellect. While their intensity may sometimes be off-putting, ENTJs take pride in their strong work ethic and remarkable self-discipline. ENTJs thrive on challenges, both big and small, firmly believing in their ability to accomplish any goal with sufficient time and resources. Their strategic thinking and long-term focus make them adept entrepreneurs and formidable business leaders, executing plans with precision and determination.",
            "strengths": "Efficiency: ENTJs view inefficiency as a hindrance to their future goals and actively eliminate it wherever they encounter it. \nEnergetic: They approach responsibilities with vigor, finding satisfaction in productivity and sharing their enthusiasm with others. \nSelf-Confident: ENTJs trust in their abilities and leadership qualities, feeling capable of facing life's challenges with confidence.",
            "weaknesses": "Intolerant: ENTJs prioritize goals over emotions and are unsupportive of ideas that deviate from their primary objectives. \nArrogant: They value quick thinking and firm convictions, sometimes looking down on those who don't meet their standards. \nPoor Handling of Emotions: ENTJs may be distant from their own emotions and insensitive to others, inadvertently hurting those close to them, particularly in emotionally charged situations.",
            "friendships": "In friendships, ENTJs seek personal growth and intellectual stimulation, preferring deep, meaningful discussions over routine-based connections. While demanding much from their friendships, they invest effort into ensuring they are fulfilling and conducive to mutual self-improvement."
        },
        "ESFJ":
        {
            "buddyType": "Terra",
            "overview": "ESFJs find life most fulfilling when shared with others. These social beings serve as the foundation of many communities, embracing friends, loved ones, and neighbors into their homes and hearts. While ESFJs may not be saints and have preferences in forming close bonds with like-minded individuals, they hold strong beliefs in hospitality and good manners, feeling a duty to support those around them. Generous and dependable, they take on the responsibility of holding families and communities together through various means, big and small.",
            "strengths": "Loyalty: ESFJs prioritize stability and security, making them reliable and trustworthy pillars in any group they belong to, whether it's family or community clubs. \nSensitivity and Warmth: They provide others with a sense of security and comfort, deeply caring about others' feelings and striving for harmony in relationships. \nAbility to Connect with Others: ESFJs are social and confident individuals who easily engage in small talk and navigate social cues, actively participating in their communities.",
            "weaknesses": "Sensitivity to Criticism: ESFJs may become defensive and hurt when faced with criticism, especially from close individuals, due to their conflict-averse nature. \nNeediness: They seek appreciation and validation, feeling distressed if their efforts go unnoticed and fishing for compliments to reaffirm their value. \nSelflessness: ESFJs may overwhelm others with excessive attention and neglect their own needs in the process, seeking validation through constant support and care.",
            "friendships": "ESFJs are highly social, maintaining large circles of friends and providing unwavering emotional support and encouragement. Committed to the traditions of friendship, they view supporting others as both a responsibility and a pleasure, expecting reciprocity for their efforts. Enjoying social interactions and introductions, ESFJs thrive in various environments while valuing mutual support and recognition."
        }
    }
}